[
    {
    "quesName": "你是否经常感到不开心或者想要哭泣？",
    "active": null,
    "options": [{
        "name": "A. 经常这样",
        "ans": {
          "persent": 15,
          "content": "有15%的人有着和你一样的选择，你不是少数，不用过分焦虑，当我们感到沮丧时，可以试着找到一些能够让自己感到舒适和放松的方式，比如听音乐、与朋友交流、或者尝试一些放松的活动。同时，记住你并不孤单，你可以向身边的人寻求支持和帮助，我们都愿意陪伴你度过难过的时刻。"
        }
      },
      {
        "name": "B. 偶尔这样",
        "ans": {
          "persent": 25,
          "content": "有25%的人有着和你一样的选择，选择人数占比不小，说明大家都或多或少感到过沮丧，自我怀疑过，所以你大可不必自我焦虑。偶尔感到情绪低落是很正常的，这并不意味着你不够坚强。重要的是，学会面对和接受这些情绪，并且找到适合自己的方式来调节情绪。"
        }
      },
      {
        "name": "C. 有过一两次",
        "ans": {
          "persent": 52,
          "content": "有52%的人有着和你一样的选择，过半的人都有过难过沮丧的时刻，但即使偶尔感到沮丧也不要觉得自己很孤单。人生中的挫折和低谷是难以避免的，但它们也是我们成长和学习的机会。无论何时，你都可以向身边的人寻求帮助和支持，我们会一直陪伴着你，帮助你度过困难的时刻。"
        }
      },
      {
        "name": "D. 从来没有过",
        "ans": {
          "persent": 8,
          "content": "有8%的人有着和你一样的选择，恭喜你！很高兴听到你从未经历过这种感觉，但也要明白，情绪起伏是正常的生活体验之一。无论何时，如果你感到情绪低落或者需要支持，都不要犹豫向身边的人寻求帮助。我们都是人，都有情绪，而你的感受也同样重要。"
        }
      }
    ]
  },
  {
    "quesName": "你最近是否经常无法集中注意力，难以正常工作或学习？",
    "active": null,
    "options": [
        {
            "name": "A. 经常这样",
            "ans": {
            "persent": 15,
            "content": "有15%的人有着和你一样的选择，我明白这种感觉可能会让你感到沮丧和不安，但请记住，这只是暂时的。尝试给自己一些喘息的时间，并专注于一件事情，逐步提高你的注意力。你不是孤单的，我们会一起度过这段艰难时期。"
            }
        },
        {
            "name": "B. 偶尔这样",
            "ans": {
            "persent": 17,
            "content": "有17%的人有着和你一样的选择，偶尔感到分心是正常的，毕竟每个人都会有这样的时刻。别太过自责，给自己一些休息和放松的时间。重要的是要记住，这些困难是可以克服的，你有足够的能力去面对并度过这一阶段。"
            }
        },
        {
            "name": "C. 有过一两次",
            "ans": {
            "persent": 43,
            "content": "有43%的人有着和你一样的选择，接近半数的人都和你有类似的经历，即使有时候难以集中注意力，也不要太过担心。这种情况是可以理解的，毕竟生活中总会有各种各样的挑战。记住，你可以寻求支持，向他人倾诉，共同应对困难。"
            }
        },
        {
            "name": "D. 从来没有过",
            "ans": {
            "persent": 25,
            "content": "有25%的人有着和你一样的选择，很好！保持良好的专注力是非常重要的，这有助于你更好地处理工作和学习。如果有一天你感到难以集中注意力，不要害怕寻求帮助或与他人分享你的感受。"
            }
        }
    ]
  }, {
    "quesName": "你是否经常有伤害自己甚至自杀的想法？",
    "active": null,
    "options": [{
        "name": "A. 经常这样",
        "ans": {
          "persent": 16,
          "content": "有16%的人有着和你一样的选择，如果你经常有这样的想法，我知道这一定很艰难。但请相信，这种情绪是可以克服的。你不是孤独的，有很多人愿意倾听你的感受，帮助你度过难关。请尽快与亲密的人或专业人士分享你的感受，他们会给你提供帮助和支持，让你渐渐摆脱这种困扰。请记住，不要伤害自己，你是值得被爱和尊重的。"
        }
      },
      {
        "name": "B. 偶尔这样",
        "ans": {
          "persent": 22,
          "content": "有22%的人与你有着一样的选择，偶尔出现这样的想法可能会让你感到沮丧和无助。但请不要放弃希望，你并不孤单。有人愿意倾听你的感受，并给予你支持和鼓励。请记住，不要伤害自己，你的生命很宝贵，有无限可能等待你去探索。"
        }
      },
      {
        "name": "C. 有过一两次",
        "ans": {
          "persent": 42,
          "content": "有42%的人有着和你一样的选择，即使只是偶尔有这样的想法，也一定会让你感到不安和焦虑。但请相信，这种情绪是可以处理的。与亲密的人或专业人士分享你的感受，让他们给予你支持和建议。不要独自承受这种压力，寻求帮助是非常重要的。请记住，不要伤害自己，你值得被关爱和尊重。"
        }
      },
      {
        "name": "D. 从来没有过",
        "ans": {
          "persent": 20,
          "content": "有20%的人有着和你一样的选择，很好，保持积极的心态是非常重要的。但如果有一天你感到沮丧或无助，不要害怕寻求帮助。你周围有很多人关心你，并愿意提供支持。记住，不要伤害自己，你的生命对于这个世界是非常重要的。"
        }
      }
    ]
  },{
    "quesName": "你是否觉得挫折也是人生宝贵的财富？",
    "active": null,
    "options": [{
        "name": "A. 总是，在我经历挫折之后我发现我收获了很多",
        "ans": {
          "persent": 18,
          "content": "有18%的人有着和你一样的选择，相信你一定是一个乐观积极的人，总是能将不幸转为幸运，人生拥有太多的挫折，我们在挫折中历练，在挫折中成长，塞翁失马，焉知非福，保持良好的心态，好运将继续伴随你。"
        }
      },
      {
        "name": "B. 偶尔，偶尔回想的时候感觉我潜意识中成长了",
        "ans": {
          "persent": 47,
          "content": "有47%的人有着和你一样的选择，经历挫折并不可怕，那一定会成为人生的一笔财富。这一时的辉煌也许是明日的落寞，这一时的挫败也许会让我们拥抱辉煌的明天，今天的挫败是在启示一个道理，我们也正就在这一个个大大小小的道理里成长。"
        }
      },
      {
        "name": "C. 不会，我觉得每个挫折都是上天用来惩罚我的",
        "ans": {
          "persent": 35,
          "content": "有35%的人有着和你一样的选择，你不是少数，总有很多人在经历挫折之后也找不到发泄口，觉得自己运气太差。但请相信，人不断的在挫折中成长，然而挫折多了，你的经历自然而然的丰富了，所以不要去抱怨挫折，你要做到的是欣然的接受它，这样才能够使你成长。"
        }
      }
    ]
  }
]