<template>
  <section class="app-shot-one" id="screenshots">
    <!-- <img src="/assets/images/background/app-shot-bg.png" alt="Awesome Image" class="app-shot-one__bg" /> -->
    <div class="container-fluid">
      <div class="block-title text-center">
        <h2 class="block-title__title">抑郁症患者数量在 <span>主要国家分布</span> 的时间变化</h2><!-- /.block-title__title -->
      </div><!-- /.block-title -->
      <div class="text1">
        <p><i class="fa fa-check"></i>近年来，抑郁症的患病率在各主要国家都呈现出上升趋势。这可能与现代社会生活节奏的加快、工作压力的增大、社交媒体的普及以及环境变化等多种因素有关。</p>
        <p><i class="fa fa-check"></i>不同国家抑郁症患者数量的变化趋势也可能受到其特有的社会、经济和文化背景的影响。例如，一些发达国家由于生活节奏快、竞争激烈，抑郁症的患病率可能相对较高；而一些发展中国家则可能由于经济压力、社会变革等因素，抑郁症的患病率也在逐渐上升。</p>
        <p><i class="fa fa-check"></i>人口结构也在一定程度上影响着抑郁症患者的数量，例如日本近年来人口老龄化严重，养老问题突出，出现了抑郁症患者的高龄化增长。</p>
      </div>
      <div id="chart" style="width: 100%; height: 80vh"></div>
    </div><!-- /.container-fluid -->
  </section>
</template>

<script>
    export default {
      name: "Screenshots",
      data() {
        return {
          list: {
            columns: ["SuicideRate", "Country", "Year"],
            data: [
              [7224648.21, '中国', 2000],
              [468445.55, '英国', 2000],
              [2372235.24, '美国', 2000],
              [255357.65, '韩国', 2000],
              [783950.76, '日本', 2000],
              [570269.85, '法国', 2000],
              [596107.92, '德国', 2000],
              [1219376.21, '俄罗斯', 2000],
              [5899943.55, '印度', 2000],
              [7313793.75, '中国', 2001],
              [569937.34, '英国', 2001],
              [2402082.62, '美国', 2001],
              [378045.21, '韩国', 2001],
              [805570.87, '日本', 2001],
              [569201.3, '法国', 2001],
              [613148.18, '德国', 2001],
              [1249792.86, '俄罗斯', 2001],
              [6056443.85, '印度', 2001],
              [7407084.89, '中国', 2002],
              [586215.45, '英国', 2002],
              [2427256.34, '美国', 2002],
              [490388.7, '韩国', 2002],
              [827570.04, '日本', 2002],
              [567205.74, '法国', 2002],
              [631020.61, '德国', 2002],
              [1278884.18, '俄罗斯', 2002],
              [6232548.09, '印度', 2002],
              [7501083.19, '中国', 2003],
              [602515.73, '英国', 2003],
              [2451155.97, '美国', 2003],
              [522830.19, '韩国', 2003],
              [849933.81, '日本', 2003],
              [565301.76, '法国', 2003],
              [649138.6, '德国', 2003],
              [1305900.85, '俄罗斯', 2003],
              [6417210.41, '印度', 2003],
              [7603486.01, '中国', 2004],
              [559579.96, '英国', 2004],
              [2476312.63, '美国', 2004],
              [755416.53, '韩国', 2004],
              [872120.46, '日本', 2004],
              [563272.52, '法国', 2004],
              [668082.2, '德国', 2004],
              [1330393.39, '俄罗斯', 2004],
              [6600328.96, '印度', 2004],
              [7708703.29, '中国', 2005],
              [508965.74, '英国', 2005],
              [2503772.27, '美国', 2005],
              [688843.14, '韩国', 2005],
              [893799.64, '日本', 2005],
              [561080.85, '法国', 2005],
              [687757.11, '德国', 2005],
              [1352532.09, '俄罗斯', 2005],
              [6766730.49, '印度', 2005],
              [7833868.72, '中国', 2006],
              [463286.24, '英国', 2006],
              [2532284.05, '美国', 2006],
              [603083.75, '韩国', 2006],
              [1012800.09, '日本', 2006],
              [559464.56, '法国', 2006],
              [702867.79, '德国', 2006],
              [1353734.59, '俄罗斯', 2006],
              [6824412.2, '印度', 2006],
              [7982300.89, '中国', 2007],
              [562260.61, '英国', 2007],
              [2557300.51, '美国', 2007],
              [558555.68, '韩国', 2007],
              [1328071.04, '日本', 2007],
              [557601.5, '法国', 2007],
              [712028.61, '德国', 2007],
              [1325701.23, '俄罗斯', 2007],
              [6741880.52, '印度', 2007],
              [8140559.74, '中国', 2008],
              [482874.25, '英国', 2008],
              [2580024.09, '美国', 2008],
              [444116.04, '韩国', 2008],
              [1251527.75, '日本', 2008],
              [555553.31, '法国', 2008],
              [719393.69, '德国', 2008],
              [1284053.49, '俄罗斯', 2008],
              [6600590.91, '印度', 2008],
              [8296610.77, '中国', 2009],
              [492018.64, '英国', 2009],
              [2601732.27, '美国', 2009],
              [378962.69, '韩国', 2009],
              [1155273.85, '日本', 2009],
              [553729.8, '法国', 2009],
              [729036.12, '德国', 2009],
              [1245350.02, '俄罗斯', 2009],
              [6495095.28, '印度', 2009],
              [8428683.31, '中国', 2010],
              [567374.15, '英国', 2010],
              [2622665.77, '美国', 2010],
              [332196.65, '韩国', 2010],
              [1232210.06, '日本', 2010],
              [552506.55, '法国', 2010],
              [745794.78, '德国', 2010],
              [1228451.47, '俄罗斯', 2010],
              [6523978.26, '印度', 2010],
              [8540747.93, '中国', 2011],
              [499537.27, '英国', 2011],
              [2643099.26, '美国', 2011],
              [294255.47, '韩国', 2011],
              [1231907.29, '日本', 2011],
              [551569.58, '法国', 2011],
              [767949.17, '德国', 2011],
              [1228997.91, '俄罗斯', 2011],
              [6660427.03, '印度', 2011],
              [8643584.64, '中国', 2012],
              [561417.91, '英国', 2012],
              [2661768.31, '美国', 2012],
              [295607.35, '韩国', 2012],
              [1212104.67, '日本', 2012],
              [550728.25, '法国', 2012],
              [791128.34, '德国', 2012],
              [1231264.48, '俄罗斯', 2012],
              [6800018.3, '印度', 2012],
              [8738798.44, '中国', 2013],
              [502724.79, '英国', 2013],
              [2679888.7, '美国', 2013],
              [296276.5, '韩国', 2013],
              [1032869.8, '日本', 2013],
              [550018.55, '法国', 2013],
              [815991.47, '德国', 2013],
              [1234763.92, '俄罗斯', 2013],
              [6944406.39, '印度', 2013],
              [8824652.68, '中国', 2014],
              [503551.42, '英国', 2014],
              [2698034.24, '美国', 2014],
              [296515.7, '韩国', 2014],
              [1054171.96, '日本', 2014],
              [549023.77, '法国', 2014],
              [841923.12, '德国', 2014],
              [1240196.53, '俄罗斯', 2014],
              [7096212.06, '印度', 2014],
              [8894942.06, '中国', 2015],
              [553489.22, '英国', 2015],
              [2715570.87, '美国', 2015],
              [296905.22, '韩国', 2015],
              [1256116.05, '日本', 2015],
              [547962.29, '法国', 2015],
              [869937.05, '德国', 2015],
              [1248040.49, '俄罗斯', 2015],
              [7254384.06, '印度', 2015],
              [8946821.33, '中国', 2016],
              [502514.36, '英国', 2016],
              [2733599.49, '美国', 2016],
              [297206.53, '韩国', 2016],
              [1268369.76, '日本', 2016],
              [546977.81, '法国', 2016],
              [899361.97, '德国', 2016],
              [1258814.78, '俄罗斯', 2016],
              [7418955.17, '印度', 2016],
              [8984826.02, '中国', 2017],
              [500447.52, '英国', 2017],
              [2751930.44, '美国', 2017],
              [297490.53, '韩国', 2017],
              [1121019.13, '日本', 2017],
              [546389.68, '法国', 2017],
              [931913.67, '德国', 2017],
              [1271941.17, '俄罗斯', 2017],
              [7595424.9, '印度', 2017],
              [9084826.02, '中国', 2018],
              [520447.52, '英国', 2018],
              [2781930.44, '美国', 2018],
              [287490.53, '韩国', 2018],
              [1151019.131, '日本', 2018],
              [548389.68, '法国', 2018],
              [941913.67, '德国', 2018],
              [1301941.17, '俄罗斯', 2018],
              [7895424.9, '印度', 2018],
              [9185432.01, '中国', 2019],
              [510456.51, '英国', 2019],
              [2753652.44, '美国', 2019],
              [287124.52, '韩国', 2019],
              [1181019.13, '日本', 2019],
              [547389.68, '法国', 2019],
              [945913.66, '德国', 2019],
              [1351941.16, '俄罗斯', 2019],
              [8225424.89, '印度', 2019]
            ],
          },
        };
      },
      mounted() {
          if ($('.app-shot-one__carousel').length) {
            $('.app-shot-one__carousel').owlCarousel({
              loop: true,
              margin: 43,
              nav: false,
              dots: false,
              autoWidth: false,
              autoplay: true,
              smartSpeed: 700,
              autoplayTimeout: 5000,
              autoplayHoverPause: true,
              slideBy: 5,
              responsive: {
                0: {
                  items: 1
                },
                480: {
                  items: 2
                },
                600: {
                  items: 3
                },
                991: {
                  items: 4
                },
                1000: {
                  items: 5
                },
                1200: {
                  items: 5
                }
              }
            });
          }


          const list = this.list.data;
          let data = [];
          for (let i = 0; i < 20; i++) {
            data.push([
              list[i * 9 + 0][0],
              list[i * 9 + 1][0],
              list[i * 9 + 2][0],
              list[i * 9 + 3][0],
              list[i * 9 + 4][0],
              list[i * 9 + 5][0],
              list[i * 9 + 6][0],
              list[i * 9 + 7][0],
              list[i * 9 + 8][0],
            ]);
          }
          console.log(data);
          let chart = this.$echarts.init(document.getElementById("chart"));
          chart.setOption({
            title: {
              text: '▎ 主要国家抑郁症患者数量（2000-2019）',
              textStyle: { color: '#444444' },
              left: 20,
              top: 20,
            },
            tooltip: {
              trigger: 'axis',
              axisPointer: {
                type: 'line',
                z: 0,
                lineStyle: {
                  color: '#ff9cad'
                }
              },
              trigger: 'item',
              formatter: function (params) {
                return (
                  (params.name || '') + '<br/>' + (params.data || '')
                )
              },
            },
            xAxis: {
              type: "value",
              axisLabel: {
                textStyle: {
                  fontSize: 20,
                },
              }, 
            },
            yAxis: {
              type: "category",
              boundaryGap: true,
              inverse: true,
              animationDuration: 300,
              animationDurationUpdate: 300,
              axisLabel: {
                interval: 0,
                textStyle: {
                  fontSize: 20,
                },
              },
              data: [
                "中国",
                "英国",
                "美国",
                "韩国",
                "日本",
                "法国",
                "德国",
                "俄罗斯",
                "印度",
              ],
            },
            grid: {
              left: 100,
              right: 60,
              top: 60,
              bottom: 60,
              containLabel: true,
            },
            graphic: {
              elements: [
                {
                  type: "text",
                  right: 160,
                  bottom: 60,
                  style: {
                    text: 2000,
                    font: "bolder 100px monospace",
                    fill: "rgba(100, 100, 100, 0.25)",
                  },
                  z: 100,
                },
              ],
            },
            series: [
              {
                realtimeSort: true,
                data: data[0],
                type: 'bar',
                areaStyle: {},
                itemStyle: {
                  // 指明颜色渐变的方向
                  // 指明不同百分比之下颜色的值
                  color: new this.$echarts.graphic.LinearGradient(0, 0, 1, 0, [
                    // 百分之0状态之下的颜色值
                    {
                      offset: 0,
                      color: '#c553d7',
                    },
                    // 百分之100状态之下的颜色值
                    {
                      offset: 1,
                      color: '#fbb787',
                    }
                  ]),
                  borderRadius: 20,
                },
              },
            ],
          });
          let m = 0;
          let currentData = data[0];
          const interval = setInterval(function () {
            if (m === 19) {
              m = -1;
              currentData = data[0];
            }
            m++;
            currentData[0] = data[m][0];
            currentData[1] = data[m][1];
            currentData[2] = data[m][2];
            currentData[3] = data[m][3];
            currentData[4] = data[m][4];
            currentData[5] = data[m][5];
            currentData[6] = data[m][6];
            currentData[7] = data[m][7];
            currentData[8] = data[m][8];
            chart.setOption({
              series: [
                {
                  data: currentData
                },
              ],
              graphic: {
                elements: [
                {
                  type: "text",
                  right: 160,
                  bottom: 60,
                  style: {
                    text: 2000 + m,
                    font: "bolder 100px monospace",
                    fill: "rgba(100, 100, 100, 0.25)",
                  },
                  z: 100,
                },
              ],
            },
          });
        },  1000);
      }
    }
</script>

<style scoped>
.text1 {
  margin-left: 6%;
}
.app-shot-one {
  background: url('/assets/images/background/app-shot-bg.png') no-repeat left center;
  background-size: 50%;
}
</style>
