<template>
  <div class="com-container">
    <div id='chart' style='width: 100%; height: 100%' class="com-chart" ref="dynamicbar_ref"></div>
  </div>
</template>

<script>
export default {
  name: 'index',
  data () {
    return {
      echarts: require('echarts'),
      list: {
        columns: ['SuicideRate', 'Country', 'Year'],
        data: [
          [45.75, '立陶宛', 2000],
          [7.74, '英国', 2000],
          [48.89, '俄罗斯', 2000],
          [13.9, '韩国', 2000],
          [35.75, '圭亚那', 2000],
          [27.43, '斯里兰卡', 2000],
          [24.96, '苏里南', 2000],
          [18.08, '日本', 2000],
          [37.26, '白俄罗斯', 2000],
          [142.1, '立陶宛', 2001],
          [7.5, '英国', 2001],
          [47.09, '俄罗斯', 2001],
          [14.78, '韩国', 2001],
          [39.86, '圭亚那', 2001],
          [22.38, '斯里兰卡', 2001],
          [27.55, '苏里南', 2001],
          [17.46, '日本', 2001],
          [38.33, '白俄罗斯', 2001],
          [42.26, '立陶宛', 2002],
          [7.48, '英国', 2002],
          [46.11, '俄罗斯', 2002],
          [17.81, '韩国', 2002],
          [39.77, '圭亚那', 2002],
          [21.46, '斯里兰卡', 2002],
          [27.68, '苏里南', 2002],
          [17.88, '日本', 2002],
          [38.72, '白俄罗斯', 2002],
          [40.19, '立陶宛', 2003],
          [7.03, '英国', 2003],
          [45.35, '俄罗斯', 2003],
          [22.27, '韩国', 2003],
          [38.13, '圭亚那', 2003],
          [21.2, '斯里兰卡', 2003],
          [27.36, '苏里南', 2003],
          [19.52, '日本', 2003],
          [37.09, '白俄罗斯', 2003],
          [38.08, '立陶宛', 2004],
          [7.23, '英国', 2004],
          [43.92, '俄罗斯', 2004],
          [23.08, '韩国', 2004],
          [37.31, '圭亚那', 2004],
          [22.08, '斯里兰卡', 2004],
          [26.63, '苏里南', 2004],
          [18.42, '日本', 2004],
          [36.05, '白俄罗斯', 2004],
          [36.88, '立陶宛', 2005],
          [6.94, '英国', 2005],
          [43.56, '俄罗斯', 2005],
          [23.97, '韩国', 2005],
          [35.58, '圭亚那', 2005],
          [28.58, '斯里兰卡', 2005],
          [26.99, '苏里南', 2005],
          [18.81, '日本', 2005],
          [37.25, '白俄罗斯', 2005],
          [29.73, '立陶宛', 2006],
          [6.89, '英国', 2006],
          [39.07, '俄罗斯', 2006],
          [20.78, '韩国', 2006],
          [34.96, '圭亚那', 2006],
          [18.41, '斯里兰卡', 2006],
          [27.29, '苏里南', 2006],
          [18.44, '日本', 2006],
          [34.76, '白俄罗斯', 2006],
          [29.87, '立陶宛', 2007],
          [6.71, '英国', 2007],
          [36.26, '俄罗斯', 2007],
          [23.24, '韩国', 2007],
          [35.06, '圭亚那', 2007],
          [20.08, '斯里兰卡', 2007],
          [27.01, '苏里南', 2007],
          [19.14, '日本', 2007],
          [30.91, '白俄罗斯', 2007],
          [32.65, '立陶宛', 2008],
          [7.26, '英国', 2008],
          [35.38, '俄罗斯', 2008],
          [24.38, '韩国', 2008],
          [33.68, '圭亚那', 2008],
          [17.47, '斯里兰卡', 2008],
          [26.7, '苏里南', 2008],
          [19.03, '日本', 2008],
          [30.58, '白俄罗斯', 2008],
          [33.09, '立陶宛', 2009],
          [7.15, '英国', 2009],
          [33.32, '俄罗斯', 2009],
          [28.78, '韩国', 2009],
          [36.31, '圭亚那', 2009],
          [22.72, '斯里兰卡', 2009],
          [26.53, '苏里南', 2009],
          [19.49, '日本', 2009],
          [30.41, '白俄罗斯', 2009],
          [31.32, '立陶宛', 2010],
          [6.95, '英国', 2010],
          [33.01, '俄罗斯', 2010],
          [27.98, '韩国', 2010],
          [36.37, '圭亚那', 2010],
          [21.87, '斯里兰卡', 2010],
          [27.42, '苏里南', 2010],
          [18.81, '日本', 2010],
          [29.89, '白俄罗斯', 2010],
          [31.85, '立陶宛', 2011],
          [7.42, '英国', 2011],
          [31.1, '俄罗斯', 2011],
          [27.89, '韩国', 2011],
          [35.31, '圭亚那', 2011],
          [17.85, '斯里兰卡', 2011],
          [26.02, '苏里南', 2011],
          [18.43, '日本', 2011],
          [30.16, '白俄罗斯', 2011],
          [29.22, '立陶宛', 2012],
          [7.36, '英国', 2012],
          [29.83, '俄罗斯', 2012],
          [24.01, '韩国', 2012],
          [37.62, '圭亚那', 2012],
          [16.4, '斯里兰卡', 2012],
          [26.82, '苏里南', 2012],
          [17.02, '日本', 2012],
          [24.63, '白俄罗斯', 2012],
          [33.97, '立陶宛', 2013],
          [7.71, '英国', 2013],
          [29.13, '俄罗斯', 2013],
          [23.84, '韩国', 2013],
          [40.71, '圭亚那', 2013],
          [14.98, '斯里兰卡', 2013],
          [26.54, '苏里南', 2013],
          [16.69, '日本', 2013],
          [22.82, '白俄罗斯', 2013],
          [29.44, '立陶宛', 2014],
          [7.64, '英国', 2014],
          [29.37, '俄罗斯', 2014],
          [22.42, '韩国', 2014],
          [39.52, '圭亚那', 2014],
          [12.72, '斯里兰卡', 2014],
          [25.94, '苏里南', 2014],
          [15.78, '日本', 2014],
          [21.59, '白俄罗斯', 2014],
          [28.93, '立陶宛', 2015],
          [7.81, '英国', 2015],
          [27.87, '俄罗斯', 2015],
          [21.2, '韩国', 2015],
          [39.3, '圭亚那', 2015],
          [14.7, '斯里兰卡', 2015],
          [25.91, '苏里南', 2015],
          [14.89, '日本', 2015],
          [19.55, '白俄罗斯', 2015],
          [26.21, '立陶宛', 2016],
          [7.62, '英国', 2016],
          [26.89, '俄罗斯', 2016],
          [20.49, '韩国', 2016],
          [39.65, '圭亚那', 2016],
          [14.17, '斯里兰卡', 2016],
          [25.47, '苏里南', 2016],
          [13.75, '日本', 2016],
          [19.4, '白俄罗斯', 2016],
          [23.49, '立陶宛', 2017],
          [7.24, '英国', 2017],
          [24.41, '俄罗斯', 2017],
          [19.31, '韩国', 2017],
          [39.86, '圭亚那', 2017],
          [13.67, '斯里兰卡', 2017],
          [25.37, '苏里南', 2017],
          [13.51, '日本', 2017],
          [18.46, '白俄罗斯', 2017],
          [21.08, '立陶宛', 2018],
          [7.08, '英国', 2018],
          [23.4, '俄罗斯', 2018],
          [21.27, '韩国', 2018],
          [40.41, '圭亚那', 2018],
          [13.24, '斯里兰卡', 2018],
          [26.23, '苏里南', 2018],
          [13.37, '日本', 2018],
          [17.94, '白俄罗斯', 2018],
          [20.15, '立陶宛', 2019],
          [6.88, '英国', 2019],
          [21.6, '俄罗斯', 2019],
          [21.16, '韩国', 2019],
          [40.85, '圭亚那', 2019],
          [12.89, '斯里兰卡', 2019],
          [25.89, '苏里南', 2019],
          [12.24, '日本', 2019],
          [116.49, '白俄罗斯', 2019]
        ]
      },
      chart: null,
      interval: null
    }
  },
  mounted () {
    this.draw();
    // 在页面加载完成的时候, 主动进行屏幕的适配
    this.screenAdapter()
  },
  destroyed () {
    clearInterval(this.timerId)
    // 在组件销毁的时候, 需要将监听器取消掉
    window.removeEventListener('resize', this.screenAdapter)
  },
  methods: {
    setEchartsData(value){
      this.clear()
      if(value){
        this.draw({titleFontSize:80,yAxisFontSize:20})
      }else{
        this.draw({titleFontSize:30,yAxisFontSize:14})
      }
    },
    screenAdapter(){
      this.chart.resize()
    },
    clear(){
      clearInterval(this.interval)
    },
    draw(obj = {titleFontSize: 30,yAxisFontSize:14}){
      const list = this.list.data
      const data = []
      for (let i = 0; i < 20; i++) {
        data.push([
          list[i * 9 + 0][0],
          list[i * 9 + 1][0],
          list[i * 9 + 2][0],
          list[i * 9 + 3][0],
          list[i * 9 + 4][0],
          list[i * 9 + 5][0],
          list[i * 9 + 6][0],
          list[i * 9 + 7][0],
          list[i * 9 + 8][0]
        ])
      }
      this.chart = this.$echarts.init(document.getElementById('chart'))
      this.chart.setOption({
        backgroundColor: '#e7e8ea',
        title: {
          text: '▎ 主要国家抑郁症患者数量（2000-2019）',
          textStyle: { color: '#444444' },
          left: 20,
          top: 20
        },
        tooltip: {
          trigger: 'axis',
          axisPointer: {
            type: 'line',
            z: 0,
            lineStyle: {
              color: '#ff9cad'
            }
          }
        },
        xAxis: {
          type: 'value'
        },
        yAxis: {
          type: 'category',
          boundaryGap: true,
          inverse: true,
          animationDuration: 300,
          animationDurationUpdate: 300,
          axisLabel: {
            interval: 0,
            textStyle: {
              fontSize: obj.yAxisFontSize
            }
          },
          data: [
            '立陶宛',
            '英国',
            '俄罗斯',
            '韩国',
            '圭亚那',
            '斯里兰卡',
            '苏里南',
            '日本',
            '白俄罗斯'
          ]
        },
        grid: {
          left: 100,
          right: 60,
          top: 60,
          bottom: 60,
          containLabel: true // 距离是包含坐标轴上的文字
        },
        graphic: {
          elements: [
            {
              type: 'text',
              right: 160,
              bottom: 60,
              style: {
                text: 2000,
                font: `bolder ${obj.titleFontSize}px monospace`,
                fill: 'rgba(100, 100, 100, 0.25)'
              },
              z: 100
            }
          ]
        },
        series: [
          {
            backgroundColor: '#e7e8ea',
            realtimeSort: true,
            data: data[0],
            type: 'bar',
            areaStyle: {},
            itemStyle: {
              // 指明颜色渐变的方向
              // 指明不同百分比之下颜色的值
              color: new this.$echarts.graphic.LinearGradient(0, 0, 1, 0, [
                // 百分之0状态之下的颜色值
                {
                  offset: 0,
                  color: '#c553d7'
                },
                // 百分之100状态之下的颜色值
                {
                  offset: 1,
                  color: '#fbb787'
                }
              ]),
              borderRadius: 20
            }
          }
        ]
      })
      let m = 0
      const currentData = data[0]
      this.interval = setInterval( ()=> {
        if (m === 19) {
          clearInterval(interval)
        }
        m++
        currentData[0] = data[m][0]
        currentData[1] = data[m][1]
        currentData[2] = data[m][2]
        currentData[3] = data[m][3]
        currentData[4] = data[m][4]
        currentData[5] = data[m][5]
        currentData[6] = data[m][6]
        currentData[7] = data[m][7]
        currentData[8] = data[m][8]
        this.chart.setOption({
          series: [
            {
              data: currentData
            }
          ],
          graphic: {
            elements: [
              {
                type: 'text',
                right: 160,
                bottom: 60,
                style: {
                  text: 2000 + m,
                  font: `bolder ${obj.titleFontSize}px monospace`,
                  fill: 'rgba(100, 100, 100, 0.25)'
                },
                z: 100
              }
            ]
          }
        })
      }, 1000)
      window.addEventListener('resize', this.screenAdapter)
    }
  }
}
</script>
<style  scoped>
</style>
